In [1]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 3CEF-302F

 Directory of C:\VcentryDAWorkspace\batch14\a2_pandas

01/06/2024  08:12    <DIR>          .
26/05/2024  09:11    <DIR>          ..
26/05/2024  10:51    <DIR>          .ipynb_checkpoints
26/05/2024  10:50            41,275 A1_PandasIntro.ipynb
01/06/2024  08:12             5,377 A2_OnlineSalse_CSV.ipynb
26/05/2024  10:49    <DIR>          data
               2 File(s)         46,652 bytes
               4 Dir(s)  30,208,290,816 bytes free

In [2]:
cd data

C:\VcentryDAWorkspace\batch14\a2_pandas\data

C:\Users\HP\AppData\Local\Programs\Python\Python312\Lib\site-packages\IPython\core\magics\osm.py:417: UserWarning: This is now an optional IPython functionality, setting dhist requires you to install the `pickleshare` library.
  self.shell.db['dhist'] = compress_dhist(dhist)[-100:]

In [3]:
pwd

'C:\\VcentryDAWorkspace\\batch14\\a2_pandas\\data'

In [4]:
#ls
#C:\VcentryDAWorkspace\batch14\a2_pandas\data\Online Sales Data.csv

In [17]:
csv_path="C:/VcentryDAWorkspace/batch14/a2_pandas/data/Online Sales Data.csv"
#/n, /t, /b
#C:\VcentryDAWorkspace\newfolder\backup

In [6]:
import pandas as pd
df=pd.read_csv(csv_path)
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [7]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [8]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [9]:
#df.Product Category
df['Product Category']

0          Electronics
1      Home Appliances
2             Clothing
3                Books
4      Beauty Products
            ...
235    Home Appliances
236           Clothing
237              Books
238    Beauty Products
239             Sports
Name: Product Category, Length: 240, dtype: object

In [10]:
df['Units Sold']

0      2
1      1
2      3
3      4
4      1
      ..
235    1
236    3
237    3
238    1
239    2
Name: Units Sold, Length: 240, dtype: int64

In [11]:
df['Units Sold'].min()

1

In [12]:
df['Units Sold'].max()

10

In [13]:
df['Units Sold'].mean()

2.158333333333333

In [14]:
df['Units Sold'].isnull

<bound method Series.isnull of 0      2
1      1
2      3
3      4
4      1
      ..
235    1
236    3
237    3
238    1
239    2
Name: Units Sold, Length: 240, dtype: int64>

In [16]:
df['Product Category']=='Electronics'

0       True
1      False
2      False
3      False
4      False
       ...
235    False
236    False
237    False
238    False
239    False
Name: Product Category, Length: 240, dtype: bool

In [18]:
csv_path=="C:/VcentryDAWorkspace/batch14/a2_pandas/data/pandas - nulldata"
import pandas as pd
df=pd.read_csv(csv_path)
df

   name    status  price
0  AAAA       NaN     10
1  BBBB       NaN     80
2  CCCC  Approved     40
3  DDDD  Cacelled     30

In [20]:
df.isnull()

    name  status  price
0  False    True  False
1  False    True  False
2  False   False  False
3  False   False  False

In [21]:
df.isna()

    name  status  price
0  False    True  False
1  False    True  False
2  False   False  False
3  False   False  False

In [25]:
df[df.isna()] #entire record is updated

  name status  price
0  NaN    NaN    NaN
1  NaN    NaN    NaN
2  NaN    NaN    NaN
3  NaN    NaN    NaN

In [26]:
df[df['status'].isna()] #data filtered

   name status  price
0  AAAA    NaN     10
1  BBBB    NaN     80